sample/all/swarm-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t4-c512-d30-R500
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=500
Running 30s test @ http://10.10.1.7:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 2.796ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.597ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.554ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.744ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.57ms    1.64ms   7.75ms   80.18%
    Req/Sec   131.06    116.75   444.00     58.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.93ms
 75.000%    3.51ms
 90.000%    5.02ms
 99.000%    7.75ms
 99.900%    9.78ms
 99.990%   11.24ms
 99.999%   11.30ms
100.000%   11.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.370     0.000000            1         1.00
       1.061     0.100000          991         1.11
       1.277     0.200000         1986         1.25
       1.575     0.300000         2971         1.43
       1.758     0.400000         3968         1.67
       1.930     0.500000         4956         2.00
       2.038     0.550000         5446         2.22
       2.171     0.600000         5941         2.50
       2.367     0.650000         6435         2.86
       2.975     0.700000         6932         3.33
       3.507     0.750000         7425         4.00
       3.727     0.775000         7675         4.44
       3.929     0.800000         7921         5.00
       4.119     0.825000         8168         5.71
       4.363     0.850000         8418         6.67
       4.687     0.875000         8664         8.00
       4.859     0.887500         8787         8.89
       5.023     0.900000         8914        10.00
       5.215     0.912500         9034        11.43
       5.423     0.925000         9158        13.33
       5.671     0.937500         9282        16.00
       5.831     0.943750         9345        17.78
       5.983     0.950000         9405        20.00
       6.103     0.956250         9468        22.86
       6.267     0.962500         9530        26.67
       6.563     0.968750         9591        32.00
       6.707     0.971875         9623        35.56
       6.823     0.975000         9653        40.00
       6.947     0.978125         9684        45.71
       7.095     0.981250         9715        53.33
       7.339     0.984375         9746        64.00
       7.423     0.985938         9761        71.11
       7.535     0.987500         9778        80.00
       7.695     0.989062         9792        91.43
       7.831     0.990625         9808       106.67
       8.007     0.992188         9823       128.00
       8.059     0.992969         9831       142.22
       8.207     0.993750         9839       160.00
       8.327     0.994531         9846       182.86
       8.559     0.995313         9854       213.33
       8.687     0.996094         9862       256.00
       8.775     0.996484         9866       284.44
       8.959     0.996875         9870       320.00
       9.151     0.997266         9873       365.71
       9.327     0.997656         9877       426.67
       9.519     0.998047         9881       512.00
       9.559     0.998242         9883       568.89
       9.631     0.998437         9885       640.00
       9.735     0.998633         9887       731.43
       9.775     0.998828         9889       853.33
       9.895     0.999023         9891      1024.00
       9.975     0.999121         9892      1137.78
      10.191     0.999219         9893      1280.00
      10.255     0.999316         9894      1462.86
      10.455     0.999414         9895      1706.67
      10.479     0.999512         9896      2048.00
      10.479     0.999561         9896      2275.56
      10.543     0.999609         9897      2560.00
      10.543     0.999658         9897      2925.71
      11.023     0.999707         9898      3413.33
      11.023     0.999756         9898      4096.00
      11.023     0.999780         9898      4551.11
      11.239     0.999805         9899      5120.00
      11.239     0.999829         9899      5851.43
      11.239     0.999854         9899      6826.67
      11.239     0.999878         9899      8192.00
      11.239     0.999890         9899      9102.22
      11.303     0.999902         9900     10240.00
      11.303     1.000000         9900          inf
#[Mean    =        2.571, StdDeviation   =        1.642]
#[Max     =       11.296, Total count    =         9900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14815 requests in 30.03s, 6.10MB read
  Socket errors: connect 0, read 0, write 0, timeout 1021
Requests/sec:    493.30
Transfer/sec:    208.09KB