sample/all/swarm-hr-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client1-t4-c512-d30-R6000
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=6000
Running 30s test @ http://10.10.1.4:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 2339.628ms, rate sampling interval: 8650ms
  Thread calibration: mean lat.: 2355.591ms, rate sampling interval: 8552ms
  Thread calibration: mean lat.: 2401.439ms, rate sampling interval: 8310ms
  Thread calibration: mean lat.: 2356.917ms, rate sampling interval: 8601ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.11s     2.74s   14.77s    61.45%
    Req/Sec   833.25      9.54     0.85k    75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.07s 
 75.000%   11.29s 
 90.000%   12.82s 
 99.000%   14.77s 
 99.900%   15.84s 
 99.990%   16.56s 
 99.999%   16.96s 
100.000%   17.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1625.087     0.000000            1         1.00
    5480.447     0.100000         6689         1.11
    6418.431     0.200000        13337         1.25
    7307.263     0.300000        20020         1.43
    8179.711     0.400000        26689         1.67
    9068.543     0.500000        33349         2.00
    9519.103     0.550000        36719         2.22
    9953.279     0.600000        40052         2.50
   10379.263     0.650000        43342         2.86
   10821.631     0.700000        46704         3.33
   11288.575     0.750000        50019         4.00
   11526.143     0.775000        51726         4.44
   11763.711     0.800000        53390         5.00
   12001.279     0.825000        55007         5.71
   12255.231     0.850000        56676         6.67
   12525.567     0.875000        58367         8.00
   12673.023     0.887500        59212         8.89
   12820.479     0.900000        60048        10.00
   12984.319     0.912500        60846        11.43
   13148.159     0.925000        61674        13.33
   13344.767     0.937500        62510        16.00
   13443.071     0.943750        62936        17.78
   13549.567     0.950000        63361        20.00
   13664.255     0.956250        63759        22.86
   13811.711     0.962500        64183        26.67
   13959.167     0.968750        64610        32.00
   14041.087     0.971875        64806        35.56
   14131.199     0.975000        65015        40.00
   14237.695     0.978125        65221        45.71
   14352.383     0.981250        65432        53.33
   14491.647     0.984375        65637        64.00
   14565.375     0.985938        65741        71.11
   14639.103     0.987500        65842        80.00
   14712.831     0.989062        65953        91.43
   14819.327     0.990625        66057       106.67
   14934.015     0.992188        66154       128.00
   14999.551     0.992969        66206       142.22
   15065.087     0.993750        66259       160.00
   15155.199     0.994531        66312       182.86
   15237.119     0.995313        66365       213.33
   15343.615     0.996094        66414       256.00
   15409.151     0.996484        66442       284.44
   15450.111     0.996875        66466       320.00
   15491.071     0.997266        66493       365.71
   15556.607     0.997656        66519       426.67
   15638.527     0.998047        66545       512.00
   15663.103     0.998242        66558       568.89
   15712.255     0.998437        66571       640.00
   15753.215     0.998633        66587       731.43
   15777.791     0.998828        66596       853.33
   15859.711     0.999023        66610      1024.00
   15900.671     0.999121        66617      1137.78
   15941.631     0.999219        66622      1280.00
   15990.783     0.999316        66630      1462.86
   16048.127     0.999414        66635      1706.67
   16138.239     0.999512        66643      2048.00
   16162.815     0.999561        66645      2275.56
   16179.199     0.999609        66649      2560.00
   16261.119     0.999658        66653      2925.71
   16302.079     0.999707        66657      3413.33
   16326.655     0.999756        66658      4096.00
   16375.807     0.999780        66660      4551.11
   16408.575     0.999805        66661      5120.00
   16465.919     0.999829        66663      5851.43
   16498.687     0.999854        66665      6826.67
   16506.879     0.999878        66666      8192.00
   16556.031     0.999890        66667      9102.22
   16572.415     0.999902        66668     10240.00
   16629.759     0.999915        66669     11702.86
   16826.367     0.999927        66670     13653.33
   16826.367     0.999939        66670     16384.00
   16924.671     0.999945        66671     18204.44
   16924.671     0.999951        66671     20480.00
   16941.055     0.999957        66672     23405.71
   16941.055     0.999963        66672     27306.67
   16941.055     0.999969        66672     32768.00
   16957.439     0.999973        66673     36408.89
   16957.439     0.999976        66673     40960.00
   16957.439     0.999979        66673     46811.43
   16957.439     0.999982        66673     54613.33
   16957.439     0.999985        66673     65536.00
   17203.199     0.999986        66674     72817.78
   17203.199     1.000000        66674          inf
#[Mean    =     9111.414, StdDeviation   =     2740.230]
#[Max     =    17186.816, Total count    =        66674]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  97527 requests in 30.03s, 40.34MB read
Requests/sec:   3248.15
Transfer/sec:      1.34MB